pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
// Cross-task handoff for ui_update_pending (dma-timing-review-2026-07-03.md
// Finding 11): browse_resp_callback runs on the UART task, writing
// browser->entries[] and then setting this flag, while the UI task reads
// the flag and then the entries. On the dual-core P4 a plain bool store
// guarantees no ordering between those writes - the UI task could see the
// flag set but the entries only partially written. The release-store /
// acquire-load pair below provides that ordering; all other stores go
// through the same helpers so no plain access ever races an atomic one on
// the same address.
static inline void browser_set_ui_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->ui_update_pending, true, __ATOMIC_RELEASE);
}
static inline void browser_clear_ui_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->ui_update_pending, false, __ATOMIC_RELAXED);
}
static inline bool browser_ui_update_pending(const wavex_file_browser_t* browser) {
    return __atomic_load_n(&browser->ui_update_pending, __ATOMIC_ACQUIRE);
}

// Cheap sibling of the flag above for selection moves that leave the viewport
// where it is: the UI task only restyles the highlight instead of destroying
// and recreating every visible LVGL button. Same release/acquire discipline -
// selection can move from the UI task (encoder) and the LVGL task (softkeys).
static inline void browser_set_selection_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->selection_update_pending, true, __ATOMIC_RELEASE);
}
static inline void browser_clear_selection_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->selection_update_pending, false, __ATOMIC_RELAXED);
}
static inline bool browser_selection_update_pending(const wavex_file_browser_t* browser) {
    return __atomic_load_n(&browser->selection_update_pending, __ATOMIC_ACQUIRE);
}

// Same cross-task hazard as ui_update_pending above, and previously missed:
// pagination_in_progress is written from the UART RX task
// (browse_resp_callback and friends) and read from the UI task
// (fb_show_loading_row / update_file_browser_ui) as a plain bool, with no
// ordering guarantee between the two cores.
static inline void browser_set_pagination_in_progress(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->pagination_in_progress, true, __ATOMIC_RELEASE);
}
static inline void browser_clear_pagination_in_progress(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->pagination_in_progress, false, __ATOMIC_RELAXED);
}
static inline bool browser_pagination_in_progress(const wavex_file_browser_t* browser) {
    return __atomic_load_n(&browser->pagination_in_progress, __ATOMIC_ACQUIRE);
}

wavex_file_browser_t* wavex_file_browser_create(lv_obj_t* parent,
                                                const wavex_file_browser_config_t* config) {
    if (!parent || !config) {
        ESP_LOGE(TAG, "Invalid parameters");
        return NULL;
    }

    wavex_file_browser_t* browser = (wavex_file_browser_t*)malloc(sizeof(wavex_file_browser_t));
    if (!browser) {
        ESP_LOGE(TAG, "Failed to allocate file browser structure");
        return NULL;
    }

    memset(browser, 0, sizeof(wavex_file_browser_t));
    browser->config = *config;
    browser->selected_index = 0;
    browser->storage_mounted = true;
    browser->first_visible_index = 0;
    browser->visible_count =
        8;  // Approximately 8 entries visible on screen (adjust based on screen size)

    browser->total_files = 0;
    browser->current_page = 0;
    browser->entries_per_page =
        20;  // Daisy now sends 20 entries per page with flexible packet system
    browser_clear_pagination_in_progress(browser);
    browser->loaded_entries = 0;

    strncpy(browser->current_path,
            config->root_path ? config->root_path : "/",
            sizeof(browser->current_path) - 1);
    browser->current_path[sizeof(browser->current_path) - 1] = '\0';

    browser->entries =
        (wavex_file_entry_t*)malloc(config->max_entries * sizeof(wavex_file_entry_t));
    if (!browser->entries) {
        ESP_LOGE(TAG, "Failed to allocate entries array");
        free(browser);
        return NULL;
    }

    // Create main container (page creation callbacks already have LVGL context)
    browser->container = lv_obj_create(parent);
    lv_obj_set_size(browser->container, lv_pct(100), lv_pct(100));
    lv_obj_set_style_bg_color(browser->container, UI_COLOR_CONTENT, LV_PART_MAIN);
    lv_obj_set_style_border_width(browser->container, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(browser->container, 0, LV_PART_MAIN);
    lv_obj_align(browser->container, LV_ALIGN_TOP_LEFT, 0, 0);

    browser->path_label = lv_label_create(browser->container);
    lv_label_set_text(browser->path_label, browser->current_path);
    ui_theme_apply_label_style(browser->path_label, false);
    lv_obj_align(browser->path_label, LV_ALIGN_TOP_LEFT, UI_PADDING_MEDIUM, UI_PADDING_MEDIUM);

    browser->list = lv_list_create(browser->container);
    // Note: Do not perform arithmetic with lv_pct(); set full height and offset below path label
    lv_obj_set_size(browser->list, lv_pct(100), lv_pct(100));
    lv_obj_align(
        browser->list, LV_ALIGN_TOP_LEFT, 0, 40);  // visually below the 40px-tall path label
    lv_obj_set_style_bg_color(browser->list, UI_COLOR_CONTENT, LV_PART_MAIN);
    lv_obj_set_style_border_width(browser->list, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(browser->list, UI_PADDING_SMALL, LV_PART_MAIN);

    // The row handler is attached per row in update_file_browser_ui(), on
    // LV_EVENT_SHORT_CLICKED - see the note there. Nothing is attached to the
    // list itself: a list-level LV_EVENT_CLICKED is exactly what did not work.

    if (config->comm_interface) {
        config->comm_interface->setBrowseResponseListener(browse_resp_callback, browser);
        // Re-list automatically when a card appears. The backend owns the card
        // slot; without this the browser only refreshes when the user leaves
        // the page and comes back.
        config->comm_interface->setStorageStatusListener(storage_status_callback, browser);
    } else {
        ESP_LOGE(TAG, "No comm interface provided to file browser");
        free(browser->entries);
        free(browser);
        return NULL;
    }

    ESP_LOGI(TAG, "Calling refresh_file_list for path: %s", browser->current_path);
    if (!refresh_file_list(browser)) {
        ESP_LOGE(TAG, "Failed to refresh file list");
    }

