pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    for (uint32_t i = 0; i < browser->entry_count; i++) {
        ESP_LOGI(TAG,
                 "Entry %d: %s (%s) - %s",
                 i,
                 browser->entries[i].name,
                 browser->entries[i].is_directory ? "DIR" : "FILE",
                 browser->entries[i].path);
    }
    return browser;
}

void wavex_file_browser_destroy(wavex_file_browser_t* browser) {
    if (!browser)
        return;

    // Deregister BEFORE freeing anything. Both listeners were registered with
    // `browser` as user_data and are invoked from the UART task, so without
    // this a browse response or an SD-eject notification arriving after the
    // page was popped would write through freed memory - reachable in practice
    // by pressing Back while a directory listing is still paginating.
    //
    // This is also why the clear has to be the blocking kind: ListenerSlot
    // holds its mutex across the invocation, so by the time these return, no
    // callback is still running and the free below is safe.
    if (browser->config.comm_interface) {
        browser->config.comm_interface->setBrowseResponseListener(nullptr, nullptr);
        browser->config.comm_interface->setStorageStatusListener(nullptr, nullptr);
    }

    if (browser->entries) {
        free(browser->entries);
    }

    if (browser->container) {
        // Page destruction should be called from LVGL context
        lv_obj_del(browser->container);
    }

    free(browser);
    ESP_LOGI(TAG, "File browser destroyed");
}

bool wavex_file_browser_navigate_to(wavex_file_browser_t* browser, const char* path) {
    if (!browser || !path)
        return false;

    strncpy(browser->current_path, path, sizeof(browser->current_path) - 1);
    browser->current_path[sizeof(browser->current_path) - 1] = '\0';

    // Mark path update as pending (navigation may be called from non-LVGL context)
    browser_set_ui_update(browser);
    wavex_ui_mark_content_changed();

    browser->first_visible_index = 0;
    browser->selected_index = 0;

    bool success = refresh_file_list(browser);

    if (success && browser->dir_changed_cb) {
        browser->dir_changed_cb(browser->current_path, browser->user_data);
    }

    return success;
}

bool wavex_file_browser_navigate_up(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    if (strcmp(browser->current_path, "/") == 0) {
        ESP_LOGI(TAG, "Already at root directory, cannot navigate up");
        return false;
    }

    // Work on a copy so current_path is untouched if navigation fails.
    char parent_path[96];
    strncpy(parent_path, browser->current_path, sizeof(parent_path) - 1);
    parent_path[sizeof(parent_path) - 1] = '\0';

    char* last_slash = strrchr(parent_path, '/');
    if (last_slash && last_slash != parent_path) {
        *last_slash = '\0';
    } else {
        strcpy(parent_path, "/");
    }

    ESP_LOGI(TAG, "Navigating up: '%s' -> '%s'", browser->current_path, parent_path);

    return wavex_file_browser_navigate_to(browser, parent_path);
}

bool wavex_file_browser_refresh(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    return refresh_file_list(browser);
}

void wavex_file_browser_set_selection(wavex_file_browser_t* browser, uint32_t index) {
    if (!browser || index >= browser->entry_count)
        return;

    browser->selected_index = index;

    // Update viewport to ensure selected entry is visible
    uint32_t prev_first_visible = browser->first_visible_index;
    if (browser->selected_index < browser->first_visible_index) {
        browser->first_visible_index = browser->selected_index;
    } else {
        uint32_t last_visible_index = browser->first_visible_index + browser->visible_count - 1;
        if (browser->selected_index > last_visible_index) {
            browser->first_visible_index = browser->selected_index - (browser->visible_count - 1);
            if (browser->first_visible_index > browser->selected_index) {
                browser->first_visible_index = 0;
            }
        }
    }

    ESP_LOGD(TAG, "Selected entry %d: %s", index, browser->entries[index].name);

    // Mark the update as pending (selection may be changed from non-LVGL
    // context): full rebuild if the viewport scrolled, highlight-only if not.
    if (browser->first_visible_index != prev_first_visible) {
        browser_set_ui_update(browser);
    } else {
        browser_set_selection_update(browser);
    }
    wavex_ui_mark_content_changed();
}

const wavex_file_entry_t* wavex_file_browser_get_selected(wavex_file_browser_t* browser) {
    if (!browser || browser->selected_index >= browser->entry_count)
        return NULL;

    return &browser->entries[browser->selected_index];
}

// Called from the UI task only. pagination_in_progress is set from several
// places including the UART task, so the flag is polled here rather than the
// row being created at each of those sites - creating LVGL objects off the UI
// task is the mistake that froze the edit page.
void wavex_file_browser_update_loading_row(wavex_file_browser_t* browser) {
    if (!browser) {
        return;
    }
    fb_show_loading_row(browser, browser_pagination_in_progress(browser));
}

bool wavex_file_browser_is_storage_mounted(wavex_file_browser_t* browser) {
    return browser ? browser->storage_mounted : false;
}

uint32_t wavex_file_browser_get_selected_index(wavex_file_browser_t* browser) {
    if (!browser)
        return 0;

    return browser->selected_index;
}

bool wavex_file_browser_navigate_up_entry(wavex_file_browser_t* browser) {
    if (!browser || browser->entry_count == 0) {
        ESP_LOGD(TAG, "navigate_up: Invalid browser or no entries");
        return false;
    }

    // No wrap-around at the first entry.
    if (browser->selected_index == 0) {
        ESP_LOGD(TAG, "navigate_up: Already at first entry (index 0)");
        return false;
    }

    uint32_t new_index = browser->selected_index - 1;
    browser->selected_index = new_index;
    ESP_LOGD(TAG, "navigate_up: moved from %u to %u", browser->selected_index + 1, new_index);

    bool viewport_moved = false;
    if (browser->selected_index < browser->first_visible_index) {
        browser->first_visible_index = browser->selected_index;
        viewport_moved = true;
        ESP_LOGD(TAG, "navigate_up: scrolled viewport to %u", browser->first_visible_index);
    }

    if (browser->file_selected_index_cb && browser->entries) {
        browser->file_selected_index_cb(browser->selected_index,
                                        &browser->entries[browser->selected_index],
                                        browser->user_data);
    }

    // Full rebuild only when the viewport scrolled; otherwise just move the
    // highlight.
    if (viewport_moved) {
        browser_set_ui_update(browser);
    } else {
        browser_set_selection_update(browser);
    }
    wavex_ui_mark_content_changed();

