pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    // Parse payload directly: BrowseRespHeader + FileEntryWire entries
    const BrowseRespHeader* browse_header = (const BrowseRespHeader*)data;
    *total_files = browse_header->total_count;
    *current_page_entries = browse_header->n;

    ESP_LOGD(TAG,
             "Browse response: total_count=%lu, n_entries=%u",
             (unsigned long)*total_files,
             *current_page_entries);

    size_t expected_size =
        sizeof(BrowseRespHeader) + (*current_page_entries * sizeof(FileEntryWire));
    if (length < expected_size) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: got %d bytes, expected %d",
                 (int)length,
                 (int)expected_size);
        *count = 0;
        *total_files = 0;
        *current_page_entries = 0;
        return false;
    }

    uint32_t parsed_count = 0;
    const FileEntryWire* wire_entries = (const FileEntryWire*)(data + sizeof(BrowseRespHeader));

    ESP_LOGD(TAG,
             "Starting file entry parsing: n_entries=%u, max_count=%u",
             *current_page_entries,
             *count);

    for (uint8_t i = 0; i < *current_page_entries && parsed_count < *count; i++) {
        const FileEntryWire* wire_entry = &wire_entries[i];
        wavex_file_entry_t* entry = &entries[parsed_count];

        entry->is_directory = wire_entry->is_dir != 0;
        entry->size_bytes = wire_entry->size_bytes;

        entry->sample_rate = wire_entry->sample_rate;
        entry->channels = wire_entry->channels;
        entry->bits_per_sample = wire_entry->bits_per_sample;
        entry->duration_ms = wire_entry->duration_ms;

        strncpy(entry->name, wire_entry->name, sizeof(entry->name) - 1);
        entry->name[sizeof(entry->name) - 1] = '\0';

        // Strip leading slash if present (Daisy sometimes includes it)
        if (entry->name[0] == '/') {
            memmove(entry->name, entry->name + 1, strlen(entry->name));
        }

        ESP_LOGD(TAG,
                 "Entry %d: Raw name from Daisy: '%s', after slash strip: '%s'",
                 i,
                 wire_entry->name,
                 entry->name);

        const char* path_base = current_path ? current_path : "/";

        ESP_LOGD(TAG, "Entry %d: current_path='%s', entry->name='%s'", i, path_base, entry->name);

        // Ensure we don't have double slashes - remove trailing slash from
        // current_path if present. Local, not static: this parser runs on the
        // UART RX task, and a static buffer here was non-reentrant.
        char trimmed_base[96];
        const char* base_path = path_base;
        if (strlen(path_base) > 1 && path_base[strlen(path_base) - 1] == '/') {
            strncpy(trimmed_base, path_base, sizeof(trimmed_base) - 1);
            trimmed_base[sizeof(trimmed_base) - 1] = '\0';
            trimmed_base[strlen(trimmed_base) - 1] = '\0';  // Remove trailing slash
            base_path = trimmed_base;
        }

        // At root, "%s/%s" of "/" + name would produce "//name" - the
        // leading slash was already stripped from entry->name above, so
        // join with a single slash instead.
        int path_len;
        if (strcmp(base_path, "/") == 0) {
            path_len = snprintf(entry->path, sizeof(entry->path), "/%s", entry->name);
        } else {
            path_len = snprintf(entry->path, sizeof(entry->path), "%s/%s", base_path, entry->name);
        }
        ESP_LOGD(TAG,
                 "Path construction: base='%s', name='%s' -> path='%s'",
                 base_path,
                 entry->name,
                 entry->path);
        if (path_len >= (int)sizeof(entry->path)) {
            // Path was truncated, ensure null termination
            entry->path[sizeof(entry->path) - 1] = '\0';
            ESP_LOGW(TAG, "Path truncated for entry: %s", entry->name);
        }

        parsed_count++;

        // DEBUG, not INFO: this runs once per entry inside the browse callback,
        // which is now invoked with the listener mutex held. At 115200 baud a
        // 20-entry page of INFO lines is a few hundred ms of console-blocked
        // time, and a page deregistering in onExit would wait all of it.
        ESP_LOGD(TAG,
                 "Parsed entry %d: '%s' (%s) - %lu bytes",
                 i,
                 entry->name,
                 entry->is_directory ? "DIR" : "FILE",
                 (unsigned long)entry->size_bytes);
    }

    *count = parsed_count;
    return true;
}

static bool send_browse_request(WaveX::Comm::ICommInterface* comm_interface,
                                const char* path,
                                uint8_t start_index) {
    if (!comm_interface) {
        ESP_LOGE(TAG, "No comm interface available for browse request");
        return false;
    }

    esp_err_t result = comm_interface->sendBrowseRequest(path, start_index);
    if (result != ESP_OK) {
        ESP_LOGE(TAG, "Failed to send browse request: %d", result);
        return false;
    }
    ESP_LOGD(
        TAG,
        "=== INTERFACE MESSAGE: Successfully sent browse request for path: %s, start_index: %d ===",
        path,
        start_index);
    return true;
}

static void browse_resp_callback(const uint8_t* data, size_t length, void* user_data) {
    wavex_file_browser_t* browser = (wavex_file_browser_t*)user_data;
    if (!browser || !data || length == 0) {
        ESP_LOGE(TAG, "Invalid browse response callback parameters");
        return;
    }

    ESP_LOGD(TAG, "Received browse response: %d bytes", (int)length);

    // Allocate on heap instead of stack to prevent stack overflow in uart_link task:
    // each entry is ~152 bytes, so 20 entries = ~3040 bytes - too large for task stack.
    wavex_file_entry_t* temp_entries = (wavex_file_entry_t*)malloc(20 * sizeof(wavex_file_entry_t));
    if (!temp_entries) {
        ESP_LOGE(TAG, "Failed to allocate memory for browse response parsing");
        browser_clear_pagination_in_progress(browser);
        return;
    }

    uint32_t temp_count = 20;
    uint32_t total_files = 0;
    uint8_t current_page_entries = 0;

