pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    bool parse_success = parse_browse_response_with_pagination(data,
                                                               length,
                                                               temp_entries,
                                                               &temp_count,
                                                               &total_files,
                                                               &current_page_entries,
                                                               browser->current_path);

    if (!parse_success) {
        free(temp_entries);
        ESP_LOGE(TAG, "Failed to parse browse response");
        browser_clear_pagination_in_progress(browser);
        // Mark error state for deferred UI update (this callback runs from UART task, not LVGL
        // context)
        browser->entry_count = 0;
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return;
    }

    // An empty listing is authoritative, and it can arrive UNSOLICITED: the
    // Daisy sends one when the card is ejected or becomes unreadable. The
    // accumulate path below cannot express it - loaded_entries is only reset
    // by refresh_file_list(), so an unsolicited response would re-adopt the
    // stale count and leave the old files on screen, and if current_page were
    // non-zero it would not even mark a UI update. Handle it directly.
    if (total_files == 0 && current_page_entries == 0) {
        free(temp_entries);
        ESP_LOGD(TAG, "Empty browse response - clearing file list");
        browser->total_files = 0;
        browser->loaded_entries = 0;
        browser->entry_count = 0;
        browser->current_page = 0;
        browser->first_visible_index = 0;
        browser->selected_index = 0;
        browser_clear_pagination_in_progress(browser);
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return;
    }

    if (browser->current_page == 0) {
        browser->total_files = total_files;
        ESP_LOGD(TAG, "Total files in directory: %d", total_files);
    }

    // Sort ".." to the top if present (only on first page, and only if not at root).
    uint32_t start_index = browser->loaded_entries;
    uint32_t parent_dir_index = 0xFFFFFFFF;

    // First pass: find ".." entry position if on first page and not at root
    if (browser->current_page == 0 && strcmp(browser->current_path, "/") != 0) {
        for (uint32_t i = 0; i < current_page_entries; i++) {
            if (strcmp(temp_entries[i].name, "..") == 0) {
                parent_dir_index = i;
                break;
            }
        }
    }

    // Second pass: add entries, putting ".." first if found on first page
    uint32_t write_index = start_index;

    if (parent_dir_index != 0xFFFFFFFF && browser->current_page == 0 &&
        strcmp(browser->current_path, "/") != 0 && write_index < browser->config.max_entries) {
        browser->entries[write_index] = temp_entries[parent_dir_index];
        browser->loaded_entries++;
        write_index++;
    }

    for (uint32_t i = 0; i < current_page_entries && write_index < browser->config.max_entries;
         i++) {
        if (parent_dir_index != 0xFFFFFFFF && i == parent_dir_index) {
            continue;  // Skip ".." if already added at the top
        }
        browser->entries[write_index] = temp_entries[i];
        browser->loaded_entries++;
        write_index++;
    }

    ESP_LOGI(TAG,
             "Loaded page %d: %d entries, total loaded: %d/%d",
             browser->current_page,
             current_page_entries,
             browser->loaded_entries,
             browser->total_files);

    free(temp_entries);

    bool has_more_pages = (browser->loaded_entries < browser->total_files) &&
                          (browser->loaded_entries < browser->config.max_entries);

    // Update UI immediately after the first page loads rather than waiting for
    // pagination to finish, so the list is not blank while later pages stream in.
    if (browser->current_page == 0) {
        browser->entry_count = browser->loaded_entries;
        browser->first_visible_index = 0;

        // Default to first entry, or ".." if it was sorted there above.
        if (browser->selected_index >= browser->entry_count) {
            browser->selected_index = 0;
        }

        ESP_LOGI(TAG, "First page loaded: marking %d entries for UI update", browser->entry_count);

        // Set flag for UI task to process (thread-safe deferred update). This
        // runs on the UART task, so the rebuild itself must happen on the UI
        // task: update_file_browser_ui() picks the flag up under the LVGL lock.
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();

        if (browser->dir_changed_cb) {
            browser->dir_changed_cb(browser->current_path, browser->user_data);
        }
    }

    if (has_more_pages) {
        browser->current_page++;
        const uint32_t next_start =
            static_cast<uint32_t>(browser->current_page) * browser->entries_per_page;

        // The wire field is uint8_t, so pagination cannot address past entry
        // 255. Stop rather than truncate: wrapping would silently re-request
        // an earlier page and loop over it forever. Unreachable at the current
        // 50-entry cap, but the cap is the only thing preventing it.
        if (next_start > UINT8_MAX) {
            ESP_LOGW(TAG,
                     "Listing exceeds the %d entries the browse protocol can address; "
                     "showing the first %lu",
                     UINT8_MAX,
                     (unsigned long)browser->loaded_entries);
            browser_clear_pagination_in_progress(browser);
            browser->entry_count = browser->loaded_entries;
            browser_set_ui_update(browser);
            wavex_ui_mark_content_changed();
            return;
        }
        const uint8_t next_start_index = static_cast<uint8_t>(next_start);

        ESP_LOGD(TAG,
                 "Requesting next page: current_page=%d, entries_per_page=%d, start_index=%d",
                 browser->current_page,
                 browser->entries_per_page,
                 next_start_index);
        if (!send_browse_request(browser->config.comm_interface, browser->current_path, next_start_index)) {
            ESP_LOGE(TAG, "Failed to request next page");
            browser_clear_pagination_in_progress(browser);
        }
        return;  // more pages requested; this function runs again when they arrive
    } else {
        browser_clear_pagination_in_progress(browser);
        browser->entry_count = browser->loaded_entries;

