pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
        if (browser->selected_index >= browser->entry_count) {
            browser->selected_index = 0;
        }

        ESP_LOGI(TAG, "Pagination complete: loaded %d entries", browser->entry_count);

        // The first-page branch above already applied these for page 0.
        if (browser->current_page > 0) {
            browser_set_ui_update(browser);
            wavex_ui_mark_content_changed();
        }

        if (browser->current_page > 0 && browser->dir_changed_cb) {
            browser->dir_changed_cb(browser->current_path, browser->user_data);
        }
    }
}

// Thread-safe function to process pending UI updates (called from UI task with LVGL lock)
void wavex_file_browser_process_pending_updates(wavex_file_browser_t* browser) {
    if (!browser) {
        ESP_LOGE(TAG, "process_pending_updates: browser is NULL!");
        return;
    }

    // Acquire-load pairs with browser_set_ui_update's release-store: once we
    // see the flag, the UART task's writes to entries[]/entry_count are
    // guaranteed visible (review Finding 11).
    bool full = browser_ui_update_pending(browser);
    bool selection_only = browser_selection_update_pending(browser);
    if (!full && !selection_only) {
        return;  // No update needed
    }

    if (full) {
        ESP_LOGD(TAG,
                 "Processing pending UI update for file browser with %d entries",
                 browser->entry_count);
        // A rebuild ends with update_visual_selection, so it satisfies any
        // concurrent highlight request too.
        browser_clear_ui_update(browser);
        browser_clear_selection_update(browser);

        // Update UI (caller must hold LVGL lock - this is called from UI task loop)
        update_file_browser_ui(browser);
    } else {
        // Selection moved within the current viewport: restyle the existing
        // buttons instead of destroying and recreating them.
        browser_clear_selection_update(browser);
        update_visual_selection(browser);
    }

    ESP_LOGD(TAG, "UI update complete");
}

// NOTE: Must be called with LVGL lock already held (from UI task loop)
static void update_file_browser_ui(wavex_file_browser_t* browser) {
    if (!browser || !browser->list)
        return;

    if (browser->path_label) {
        lv_label_set_text(browser->path_label, browser->current_path);
    }

    // Clearing the list destroys the spinner row along with everything else,
    // so drop our handle to it. Leaving it dangling made fb_show_loading_row()
    // delete whatever LVGL later allocated at the same address - the pointer
    // compares "valid" again once the allocator reuses it.
    lv_obj_clean(browser->list);
    browser->loading_row = nullptr;

    if (browser->entry_count > 0 && browser->entries) {
        if (browser->first_visible_index >= browser->entry_count) {
            browser->first_visible_index = 0;
        }

        uint32_t start_index = browser->first_visible_index;
        uint32_t end_index = start_index + browser->visible_count;
        if (end_index > browser->entry_count) {
            end_index = browser->entry_count;
        }

        for (uint32_t i = start_index; i < end_index; i++) {
            if (!browser->entries[i].name[0]) {
                ESP_LOGW(TAG, "Skipping empty entry at index %d", i);
                continue;
            }

            lv_obj_t* btn = lv_list_add_btn(browser->list, NULL, browser->entries[i].name);
            if (!btn) {
                ESP_LOGE(TAG, "Failed to create button for entry %d", i);
                continue;
            }

            ui_theme_apply_button_style(btn, true);
            fb_style_row(btn, &browser->entries[i], i == browser->selected_index);

            if (browser->entries[i].is_directory) {
                lv_obj_t* label = lv_obj_get_child(btn, 0);
                if (label) {
                    char dir_text[64];
                    snprintf(dir_text, sizeof(dir_text), "[DIR] %s", browser->entries[i].name);
                    lv_label_set_text(label, dir_text);
                }
            }

            // Entry index stored on the button; update_visual_selection() and
            // file_list_event_cb() read it back to map a row to its data.
            lv_obj_set_user_data(btn, (void*)(uintptr_t)i);
            // SHORT_CLICKED on the row, not CLICKED on the list.
            //
            // The list is scrollable, and LVGL suppresses LV_EVENT_CLICKED when
            // a press on a scrollable object is taken as the start of a scroll
            // gesture - which on a touch panel is most taps, because a finger
            // rarely lands and lifts without moving. The row still showed its
            // pressed style, so the tap looked registered while the selection
            // never moved. SHORT_CLICKED fires on a quick press-release and is
            // what UIMenuPage's items already use.
            lv_obj_add_event_cb(btn, file_list_event_cb, LV_EVENT_SHORT_CLICKED, browser);
        }

        update_visual_selection(browser);

        ESP_LOGD(TAG, "Updated file browser UI with %d entries", browser->entry_count);
    } else if (browser->entry_count == 0 && !browser_pagination_in_progress(browser)) {
        // Pagination finished and the directory is genuinely empty.
        lv_obj_t* btn = lv_list_add_btn(browser->list, NULL, "No files found...");
        lv_obj_set_user_data(btn, (void*)(uintptr_t)FB_ROW_NOT_AN_ENTRY);
        ui_theme_apply_button_style(btn, false);
        lv_obj_set_style_text_color(btn, UI_COLOR_TEXT, LV_PART_MAIN);
        lv_obj_set_style_text_font(btn, &lv_font_montserrat_18, LV_PART_MAIN);
        ESP_LOGI(TAG, "No files found in directory");
    } else {
        // Reached only when entry_count is 0 and pagination is still in
        // progress (browser->entries is always allocated once the browser
        // exists, so the entry_count > 0 branch above covers every other
        // case). This fires briefly on every navigation before the first
        // page arrives, labeled here as an error rather than a loading state.
        lv_obj_t* btn = lv_list_add_btn(browser->list, NULL, "Error loading files");
        lv_obj_set_user_data(btn, (void*)(uintptr_t)FB_ROW_NOT_AN_ENTRY);
        ui_theme_apply_button_style(btn, false);
        lv_obj_set_style_text_color(btn, UI_COLOR_TEXT, LV_PART_MAIN);
        lv_obj_set_style_text_font(btn, &lv_font_montserrat_18, LV_PART_MAIN);
        ESP_LOGI(TAG, "Showing error message in file browser");
    }

    wavex_ui_mark_content_changed();
}

