pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
// NOTE: Must be called with LVGL lock already held. child_count only covers
// the currently-visible rows, since off-screen entries have no LVGL object.
static void update_visual_selection(wavex_file_browser_t* browser) {
    if (!browser || !browser->list)
        return;

    uint32_t child_count = lv_obj_get_child_cnt(browser->list);

    if (browser->selected_index >= browser->entry_count) {
        browser->selected_index = 0;
    }

    for (uint32_t i = 0; i < child_count; i++) {
        lv_obj_t* btn = lv_obj_get_child(browser->list, i);
        if (btn) {
            uint32_t entry_index = (uint32_t)(uintptr_t)lv_obj_get_user_data(btn);

            const wavex_file_entry_t* entry =
                (entry_index < browser->entry_count) ? &browser->entries[entry_index] : nullptr;
            fb_style_row(btn, entry, entry_index == browser->selected_index);
        }
    }
    wavex_ui_mark_content_changed();
}

// Storage appeared or vanished. Runs on the UART task, so it must not touch
// LVGL - refresh_file_list() only sends a browse request and sets the deferred
// UI-update flag, which is safe from here.
static void storage_status_callback(bool mounted, void* user_data) {
    wavex_file_browser_t* browser = (wavex_file_browser_t*)user_data;
    if (!browser) {
        return;
    }
    browser->storage_mounted = mounted;
    if (!mounted) {
        // The empty browse response that accompanies a loss already clears the
        // list; nothing to do but stop any pagination still in flight.
        browser_clear_pagination_in_progress(browser);
        ESP_LOGI(TAG, "Storage lost - browser idle");
        return;
    }
    ESP_LOGI(TAG, "Storage available - re-listing '%s'", browser->current_path);
    refresh_file_list(browser);
}
